[
    {
    "id": "3331",
    "parent_id": "2121",
    "name": "Бар",
    "areas": [ ]
    },
    {
    "id": "3332",
    "parent_id": "2121",
    "name": "Бершадь",
    "areas": [ ]
    },
    {
    "id": "116",
    "parent_id": "2121",
    "name": "Винница",
    "areas": [ ]
    },
    {
    "id": "3333",
    "parent_id": "2121",
    "name": "Гайсин",
    "areas": [ ]
    },
    {
    "id": "3641",
    "parent_id": "2121",
    "name": "Гнивань",
    "areas": [ ]
    },
    {
    "id": "3334",
    "parent_id": "2121",
    "name": "Жмеринка",
    "areas": [ ]
    },
    {
    "id": "3335",
    "parent_id": "2121",
    "name": "Ильинцы",
    "areas": [ ]
    },
    {
    "id": "3336",
    "parent_id": "2121",
    "name": "Казатин",
    "areas": [ ]
    },
    {
    "id": "3337",
    "parent_id": "2121",
    "name": "Калиновка",
    "areas": [ ]
    },
    {
    "id": "3338",
    "parent_id": "2121",
    "name": "Крыжополь",
    "areas": [ ]
    },
    {
    "id": "3339",
    "parent_id": "2121",
    "name": "Ладыжин",
    "areas": [ ]
    },
    {
    "id": "3340",
    "parent_id": "2121",
    "name": "Липовец",
    "areas": [ ]
    },
    {
    "id": "3341",
    "parent_id": "2121",
    "name": "Литин",
    "areas": [ ]
    },
    {
    "id": "3342",
    "parent_id": "2121",
    "name": "Могилевт-Подольский",
    "areas": [ ]
    },
    {
    "id": "3343",
    "parent_id": "2121",
    "name": "Мурованые Куриловцы",
    "areas": [ ]
    },
    {
    "id": "3344",
    "parent_id": "2121",
    "name": "Немиров",
    "areas": [ ]
    },
    {
    "id": "3345",
    "parent_id": "2121",
    "name": "Оратов",
    "areas": [ ]
    },
    {
        "id": "2131",
        "parent_id": "2126",
        "name": "Никополь",
        "areas": [ ]
        },
        {
        "id": "2132",
        "parent_id": "2126",
        "name": "Новомосковск (Днепропетровская область)",
        "areas": [ ]
        },
        {
        "id": "3139",
        "parent_id": "2126",
        "name": "Покров (Днепропетровская область)",
        "areas": [ ]
        },
        {
        "id": "2133",
        "parent_id": "2126",
        "name": "Павлоград",
        "areas": [ ]
        },
        {
        "id": "3645",
        "parent_id": "2126",
        "name": "Перещепино",
        "areas": [ ]
        },
        {
        "id": "3072",
        "parent_id": "2126",
        "name": "Першотравенск",
        "areas": [ ]
        },
        {
        "id": "3141",
        "parent_id": "2126",
        "name": "Петриковка",
        "areas": [ ]
        },
        {
        "id": "3142",
        "parent_id": "2126",
        "name": "Петропавловка",
        "areas": [ ]
        },
        {
        "id": "3646",
        "parent_id": "2126",
        "name": "Подгородное",
        "areas": [ ]
        },
        {
        "id": "3143",
        "parent_id": "2126",
        "name": "Покровское",
        "areas": [ ]
        },
        {
        "id": "3144",
        "parent_id": "2126",
        "name": "Пятихатки",
        "areas": [ ]
        },
        {
        "id": "3145",
        "parent_id": "2126",
        "name": "Синельниково",
        "areas": [ ]
        },
        {
        "id": "3146",
        "parent_id": "2126",
        "name": "Соленое",
        "areas": [ ]
        },
        {
        "id": "3147",
        "parent_id": "2126",
        "name": "Софиевка",
        "areas": [ ]
        },
        {
        "id": "3148",
        "parent_id": "2126",
        "name": "Терновка",
        "areas": [ ]
        },
        {
        "id": "3149",
        "parent_id": "2126",
        "name": "Томаковка",
        "areas": [ ]
        },
        {
        "id": "3150",
        "parent_id": "2126",
        "name": "Царичанка",
        "areas": [ ]
        },
        {
        "id": "3151",
        "parent_id": "2126",
        "name": "Широкое",
        "areas": [ ]
        },
        {
        "id": "3152",
        "parent_id": "2126",
        "name": "Юрьевка",
        "areas": [ ]
        },
        {
        "id": "3238",
        "parent_id": "2134",
        "name": "Авдеевка",
        "areas": [ ]
        },
        {
        "id": "3239",
        "parent_id": "2134",
        "name": "Александровка (Донецкая область)",
        "areas": [ ]
        },
        {
        "id": "3240",
        "parent_id": "2134",
        "name": "Амвросиевка",
        "areas": [ ]
        },
        {
        "id": "3630",
        "parent_id": "2134",
        "name": "Артемово",
        "areas": [ ]
        },
        {
        "id": "2135",
        "parent_id": "2134",
        "name": "Артемовск (Украина)",
        "areas": [ ]
        },
        {
        "id": "3633",
        "parent_id": "2134",
        "name": "Белицкое",
        "areas": [ ]
        },
        {
        "id": "3242",
        "parent_id": "2134",
        "name": "Белозерское",
        "areas": [ ]
        },
        {
        "id": "3243",
        "parent_id": "2134",
        "name": "Великая Новоселка",
        "areas": [ ]
        },
        {
        "id": "3244",
        "parent_id": "2134",
        "name": "Волноваха",
        "areas": [ ]
        },
        {
        "id": "3245",
        "parent_id": "2134",
        "name": "Володарское (Донецкая область)",
        "areas": [ ]
        },
        {
        "id": "2136",
        "parent_id": "2134",
        "name": "Горловка",
        "areas": [ ]
        },
        {
        "id": "3246",
        "parent_id": "2134",
        "name": "Дебальцево",
        "areas": [ ]
        },
        {
        "id": "3247",
        "parent_id": "2134",
        "name": "Дзержинск (Донецкая область)",
        "areas": [ ]
        },
        {
        "id": "3248",
        "parent_id": "2134",
        "name": "Димитров",
        "areas": [ ]
        },
        {
        "id": "3249",
        "parent_id": "2134",
        "name": "Доброполье",
        "areas": [ ]
        },
        {
        "id": "3250",
        "parent_id": "2134",
        "name": "Докучаевск",
        "areas": [ ]
        },
        {
        "id": "118",
        "parent_id": "2134",
        "name": "Донецк (Украина)",
        "areas": [ ]
        },
        {
        "id": "2508",
        "parent_id": "2134",
        "name": "Дружковка",
        "areas": [ ]
        },
        {
        "id": "2138",
        "parent_id": "2134",
        "name": "Енакиево",
        "areas": [ ]
        },
        {
        "id": "3251",
        "parent_id": "2134",
        "name": "Зугрэс",
        "areas": [ ]
        },
        {
        "id": "3253",
        "parent_id": "2134",
        "name": "Кировское (Донецкая область)",
        "areas": [ ]
        },
        {
        "id": "2656",
        "parent_id": "2134",
        "name": "Константиновка",
        "areas": [ ]
        }
]
